/* automatically generated by rust-bindgen 0.72.1 */

pub const __WORDSIZE: u32 = 64;
pub const __has_safe_buffers: u32 = 1;
pub const __DARWIN_ONLY_64_BIT_INO_T: u32 = 1;
pub const __DARWIN_ONLY_UNIX_CONFORMANCE: u32 = 1;
pub const __DARWIN_ONLY_VERS_1050: u32 = 1;
pub const __DARWIN_UNIX03: u32 = 1;
pub const __DARWIN_64_BIT_INO_T: u32 = 1;
pub const __DARWIN_VERS_1050: u32 = 1;
pub const __DARWIN_NON_CANCELABLE: u32 = 0;
pub const __DARWIN_SUF_EXTSN: &[u8; 14] = b"$DARWIN_EXTSN\0";
pub const __DARWIN_C_ANSI: u32 = 4096;
pub const __DARWIN_C_FULL: u32 = 900000;
pub const __DARWIN_C_LEVEL: u32 = 900000;
pub const __STDC_WANT_LIB_EXT1__: u32 = 1;
pub const __DARWIN_NO_LONG_LONG: u32 = 0;
pub const _DARWIN_FEATURE_64_BIT_INODE: u32 = 1;
pub const _DARWIN_FEATURE_ONLY_64_BIT_INODE: u32 = 1;
pub const _DARWIN_FEATURE_ONLY_VERS_1050: u32 = 1;
pub const _DARWIN_FEATURE_ONLY_UNIX_CONFORMANCE: u32 = 1;
pub const _DARWIN_FEATURE_UNIX_CONFORMANCE: u32 = 3;
pub const __has_ptrcheck: u32 = 0;
pub const __has_bounds_safety_attributes: u32 = 0;
pub const USE_CLANG_TYPES: u32 = 0;
pub const __PTHREAD_SIZE__: u32 = 8176;
pub const __PTHREAD_ATTR_SIZE__: u32 = 56;
pub const __PTHREAD_MUTEXATTR_SIZE__: u32 = 8;
pub const __PTHREAD_MUTEX_SIZE__: u32 = 56;
pub const __PTHREAD_CONDATTR_SIZE__: u32 = 8;
pub const __PTHREAD_COND_SIZE__: u32 = 40;
pub const __PTHREAD_ONCE_SIZE__: u32 = 8;
pub const __PTHREAD_RWLOCK_SIZE__: u32 = 192;
pub const __PTHREAD_RWLOCKATTR_SIZE__: u32 = 16;

pub const D65_Z0: f64 = 108.8827;
pub const D50_X0: f64 = 96.425;
pub const D50_Y0: f64 = 100.0;
pub const D50_Z0: f64 = 82.468;
pub const CIELABTORGB_TABLE_RANGE: u32 = 1500;
pub const USE_CLANG_STDARG: u32 = 0;
pub const RENAME_SECLUDE: u32 = 1;
pub const RENAME_SWAP: u32 = 2;
pub const RENAME_EXCL: u32 = 4;
pub const RENAME_RESERVED1: u32 = 8;
pub const RENAME_NOFOLLOW_ANY: u32 = 16;
pub const RENAME_RESOLVE_BENEATH: u32 = 32;
pub const SEEK_SET: u32 = 0;
pub const SEEK_CUR: u32 = 1;
pub const SEEK_END: u32 = 2;
pub const SEEK_HOLE: u32 = 3;
pub const SEEK_DATA: u32 = 4;
pub const __SLBF: u32 = 1;
pub const __SNBF: u32 = 2;
pub const __SRD: u32 = 4;
pub const __SWR: u32 = 8;
pub const __SRW: u32 = 16;
pub const __SEOF: u32 = 32;
pub const __SERR: u32 = 64;
pub const __SMBF: u32 = 128;
pub const __SAPP: u32 = 256;
pub const __SSTR: u32 = 512;
pub const __SOPT: u32 = 1024;
pub const __SNPT: u32 = 2048;
pub const __SOFF: u32 = 4096;
pub const __SMOD: u32 = 8192;
pub const __SALC: u32 = 16384;
pub const __SIGN: u32 = 32768;
pub const _IOFBF: u32 = 0;
pub const _IOLBF: u32 = 1;
pub const _IONBF: u32 = 2;
pub const BUFSIZ: u32 = 1024;
pub const EOF: i32 = -1;
pub const FOPEN_MAX: u32 = 20;
pub const FILENAME_MAX: u32 = 1024;
pub const P_tmpdir: &[u8; 10] = b"/var/tmp/\0";
pub const L_tmpnam: u32 = 1024;
pub const TMP_MAX: u32 = 308915776;
pub const L_ctermid: u32 = 1024;
pub const _USE_FORTIFY_LEVEL: u32 = 2;
pub const LOGLUV_PUBLIC: u32 = 1;
pub const TIFF_VARIABLE: i32 = -1;
pub const TIFF_SPP: i32 = -2;
pub const TIFF_VARIABLE2: i32 = -3;
pub const FIELD_CUSTOM: u32 = 65;
pub const U_NEU: f64 = 0.210526316;
pub const V_NEU: f64 = 0.473684211;
pub const UVSCALE: f64 = 410.0;
pub type wchar_t = ::std::os::raw::c_int;
pub type max_align_t = f64;
pub type int_least8_t = i8;
pub type int_least16_t = i16;
pub type int_least32_t = i32;
pub type int_least64_t = i64;
pub type uint_least8_t = u8;
pub type uint_least16_t = u16;
pub type uint_least32_t = u32;
pub type uint_least64_t = u64;
pub type int_fast8_t = i8;
pub type int_fast16_t = i16;
pub type int_fast32_t = i32;
pub type int_fast64_t = i64;
pub type uint_fast8_t = u8;
pub type uint_fast16_t = u16;
pub type uint_fast32_t = u32;
pub type uint_fast64_t = u64;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_longlong;
pub type __uint64_t = ::std::os::raw::c_ulonglong;
pub type __darwin_intptr_t = ::std::os::raw::c_long;
pub type __darwin_natural_t = ::std::os::raw::c_uint;
pub type __darwin_ct_rune_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t {
    pub __mbstate8: [::std::os::raw::c_char; 128usize],
    pub _mbstateL: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __mbstate_t"][::std::mem::size_of::<__mbstate_t>() - 128usize];
    ["Alignment of __mbstate_t"][::std::mem::align_of::<__mbstate_t>() - 8usize];
    ["Offset of field: __mbstate_t::__mbstate8"]
        [::std::mem::offset_of!(__mbstate_t, __mbstate8) - 0usize];
    ["Offset of field: __mbstate_t::_mbstateL"]
        [::std::mem::offset_of!(__mbstate_t, _mbstateL) - 0usize];
};
pub type __darwin_mbstate_t = __mbstate_t;
pub type __darwin_ptrdiff_t = ::std::os::raw::c_long;
pub type __darwin_size_t = ::std::os::raw::c_ulong;
pub type __darwin_va_list = __builtin_va_list;
pub type __darwin_wchar_t = ::std::os::raw::c_int;
pub type __darwin_rune_t = __darwin_wchar_t;
pub type __darwin_wint_t = ::std::os::raw::c_int;
pub type __darwin_clock_t = ::std::os::raw::c_ulong;
pub type __darwin_socklen_t = __uint32_t;
pub type __darwin_ssize_t = ::std::os::raw::c_long;
pub type __darwin_time_t = ::std::os::raw::c_long;
pub type __darwin_blkcnt_t = __int64_t;
pub type __darwin_blksize_t = __int32_t;
pub type __darwin_dev_t = __int32_t;
pub type __darwin_fsblkcnt_t = ::std::os::raw::c_uint;
pub type __darwin_fsfilcnt_t = ::std::os::raw::c_uint;
pub type __darwin_gid_t = __uint32_t;
pub type __darwin_id_t = __uint32_t;
pub type __darwin_ino64_t = __uint64_t;
pub type __darwin_ino_t = __darwin_ino64_t;
pub type __darwin_mach_port_name_t = __darwin_natural_t;
pub type __darwin_mach_port_t = __darwin_mach_port_name_t;
pub type __darwin_mode_t = __uint16_t;
pub type __darwin_off_t = __int64_t;
pub type __darwin_pid_t = __int32_t;
pub type __darwin_sigset_t = __uint32_t;
pub type __darwin_suseconds_t = __int32_t;
pub type __darwin_uid_t = __uint32_t;
pub type __darwin_useconds_t = __uint32_t;
pub type __darwin_uuid_t = [::std::os::raw::c_uchar; 16usize];
pub type __darwin_uuid_string_t = [::std::os::raw::c_char; 37usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_pthread_handler_rec {
    pub __routine: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub __arg: *mut ::std::os::raw::c_void,
    pub __next: *mut __darwin_pthread_handler_rec,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_pthread_handler_rec"]
        [::std::mem::size_of::<__darwin_pthread_handler_rec>() - 24usize];
    ["Alignment of __darwin_pthread_handler_rec"]
        [::std::mem::align_of::<__darwin_pthread_handler_rec>() - 8usize];
    ["Offset of field: __darwin_pthread_handler_rec::__routine"]
        [::std::mem::offset_of!(__darwin_pthread_handler_rec, __routine) - 0usize];
    ["Offset of field: __darwin_pthread_handler_rec::__arg"]
        [::std::mem::offset_of!(__darwin_pthread_handler_rec, __arg) - 8usize];
    ["Offset of field: __darwin_pthread_handler_rec::__next"]
        [::std::mem::offset_of!(__darwin_pthread_handler_rec, __next) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_attr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 56usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_attr_t"][::std::mem::size_of::<_opaque_pthread_attr_t>() - 64usize];
    ["Alignment of _opaque_pthread_attr_t"]
        [::std::mem::align_of::<_opaque_pthread_attr_t>() - 8usize];
    ["Offset of field: _opaque_pthread_attr_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_attr_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_attr_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_attr_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_cond_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 40usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_cond_t"][::std::mem::size_of::<_opaque_pthread_cond_t>() - 48usize];
    ["Alignment of _opaque_pthread_cond_t"]
        [::std::mem::align_of::<_opaque_pthread_cond_t>() - 8usize];
    ["Offset of field: _opaque_pthread_cond_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_cond_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_cond_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_cond_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_condattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_condattr_t"]
        [::std::mem::size_of::<_opaque_pthread_condattr_t>() - 16usize];
    ["Alignment of _opaque_pthread_condattr_t"]
        [::std::mem::align_of::<_opaque_pthread_condattr_t>() - 8usize];
    ["Offset of field: _opaque_pthread_condattr_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_condattr_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_condattr_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_condattr_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_mutex_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 56usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_mutex_t"][::std::mem::size_of::<_opaque_pthread_mutex_t>() - 64usize];
    ["Alignment of _opaque_pthread_mutex_t"]
        [::std::mem::align_of::<_opaque_pthread_mutex_t>() - 8usize];
    ["Offset of field: _opaque_pthread_mutex_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_mutex_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_mutex_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_mutex_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_mutexattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_mutexattr_t"]
        [::std::mem::size_of::<_opaque_pthread_mutexattr_t>() - 16usize];
    ["Alignment of _opaque_pthread_mutexattr_t"]
        [::std::mem::align_of::<_opaque_pthread_mutexattr_t>() - 8usize];
    ["Offset of field: _opaque_pthread_mutexattr_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_mutexattr_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_mutexattr_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_mutexattr_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_once_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_once_t"][::std::mem::size_of::<_opaque_pthread_once_t>() - 16usize];
    ["Alignment of _opaque_pthread_once_t"]
        [::std::mem::align_of::<_opaque_pthread_once_t>() - 8usize];
    ["Offset of field: _opaque_pthread_once_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_once_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_once_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_once_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_rwlock_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 192usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_rwlock_t"]
        [::std::mem::size_of::<_opaque_pthread_rwlock_t>() - 200usize];
    ["Alignment of _opaque_pthread_rwlock_t"]
        [::std::mem::align_of::<_opaque_pthread_rwlock_t>() - 8usize];
    ["Offset of field: _opaque_pthread_rwlock_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_rwlock_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_rwlock_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_rwlock_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_rwlockattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_rwlockattr_t"]
        [::std::mem::size_of::<_opaque_pthread_rwlockattr_t>() - 24usize];
    ["Alignment of _opaque_pthread_rwlockattr_t"]
        [::std::mem::align_of::<_opaque_pthread_rwlockattr_t>() - 8usize];
    ["Offset of field: _opaque_pthread_rwlockattr_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_rwlockattr_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_rwlockattr_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_rwlockattr_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_t {
    pub __sig: ::std::os::raw::c_long,
    pub __cleanup_stack: *mut __darwin_pthread_handler_rec,
    pub __opaque: [::std::os::raw::c_char; 8176usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_t"][::std::mem::size_of::<_opaque_pthread_t>() - 8192usize];
    ["Alignment of _opaque_pthread_t"][::std::mem::align_of::<_opaque_pthread_t>() - 8usize];
    ["Offset of field: _opaque_pthread_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_t::__cleanup_stack"]
        [::std::mem::offset_of!(_opaque_pthread_t, __cleanup_stack) - 8usize];
    ["Offset of field: _opaque_pthread_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_t, __opaque) - 16usize];
};
pub type __darwin_pthread_attr_t = _opaque_pthread_attr_t;
pub type __darwin_pthread_cond_t = _opaque_pthread_cond_t;
pub type __darwin_pthread_condattr_t = _opaque_pthread_condattr_t;
pub type __darwin_pthread_key_t = ::std::os::raw::c_ulong;
pub type __darwin_pthread_mutex_t = _opaque_pthread_mutex_t;
pub type __darwin_pthread_mutexattr_t = _opaque_pthread_mutexattr_t;
pub type __darwin_pthread_once_t = _opaque_pthread_once_t;
pub type __darwin_pthread_rwlock_t = _opaque_pthread_rwlock_t;
pub type __darwin_pthread_rwlockattr_t = _opaque_pthread_rwlockattr_t;
pub type __darwin_pthread_t = *mut _opaque_pthread_t;
pub type intmax_t = ::std::os::raw::c_long;
pub type uintmax_t = ::std::os::raw::c_ulong;
pub type __darwin_nl_item = ::std::os::raw::c_int;
pub type __darwin_wctrans_t = ::std::os::raw::c_int;
pub type __darwin_wctype_t = __uint32_t;
unsafe extern "C" {
    pub fn imaxabs(j: intmax_t) -> intmax_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct imaxdiv_t {
    pub quot: intmax_t,
    pub rem: intmax_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of imaxdiv_t"][::std::mem::size_of::<imaxdiv_t>() - 16usize];
    ["Alignment of imaxdiv_t"][::std::mem::align_of::<imaxdiv_t>() - 8usize];
    ["Offset of field: imaxdiv_t::quot"][::std::mem::offset_of!(imaxdiv_t, quot) - 0usize];
    ["Offset of field: imaxdiv_t::rem"][::std::mem::offset_of!(imaxdiv_t, rem) - 8usize];
};
unsafe extern "C" {
    pub fn imaxdiv(__numer: intmax_t, __denom: intmax_t) -> imaxdiv_t;
}
unsafe extern "C" {
    pub fn strtoimax(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> intmax_t;
}
unsafe extern "C" {
    pub fn strtoumax(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
unsafe extern "C" {
    pub fn wcstoimax(
        __nptr: *const wchar_t,
        __endptr: *mut *mut wchar_t,
        __base: ::std::os::raw::c_int,
    ) -> intmax_t;
}
unsafe extern "C" {
    pub fn wcstoumax(
        __nptr: *const wchar_t,
        __endptr: *mut *mut wchar_t,
        __base: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
pub type int8 = i8;
pub type uint8 = u8;
pub type int16 = i16;
pub type uint16 = u16;
pub type int32 = i32;
pub type uint32 = u32;
pub type int64 = i64;
pub type uint64 = u64;
pub type uint16_vap = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TIFFHeaderCommon {
    pub tiff_magic: u16,
    pub tiff_version: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TIFFHeaderCommon"][::std::mem::size_of::<TIFFHeaderCommon>() - 4usize];
    ["Alignment of TIFFHeaderCommon"][::std::mem::align_of::<TIFFHeaderCommon>() - 2usize];
    ["Offset of field: TIFFHeaderCommon::tiff_magic"]
        [::std::mem::offset_of!(TIFFHeaderCommon, tiff_magic) - 0usize];
    ["Offset of field: TIFFHeaderCommon::tiff_version"]
        [::std::mem::offset_of!(TIFFHeaderCommon, tiff_version) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TIFFHeaderClassic {
    pub tiff_magic: u16,
    pub tiff_version: u16,
    pub tiff_diroff: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TIFFHeaderClassic"][::std::mem::size_of::<TIFFHeaderClassic>() - 8usize];
    ["Alignment of TIFFHeaderClassic"][::std::mem::align_of::<TIFFHeaderClassic>() - 4usize];
    ["Offset of field: TIFFHeaderClassic::tiff_magic"]
        [::std::mem::offset_of!(TIFFHeaderClassic, tiff_magic) - 0usize];
    ["Offset of field: TIFFHeaderClassic::tiff_version"]
        [::std::mem::offset_of!(TIFFHeaderClassic, tiff_version) - 2usize];
    ["Offset of field: TIFFHeaderClassic::tiff_diroff"]
        [::std::mem::offset_of!(TIFFHeaderClassic, tiff_diroff) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TIFFHeaderBig {
    pub tiff_magic: u16,
    pub tiff_version: u16,
    pub tiff_offsetsize: u16,
    pub tiff_unused: u16,
    pub tiff_diroff: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TIFFHeaderBig"][::std::mem::size_of::<TIFFHeaderBig>() - 16usize];
    ["Alignment of TIFFHeaderBig"][::std::mem::align_of::<TIFFHeaderBig>() - 8usize];
    ["Offset of field: TIFFHeaderBig::tiff_magic"]
        [::std::mem::offset_of!(TIFFHeaderBig, tiff_magic) - 0usize];
    ["Offset of field: TIFFHeaderBig::tiff_version"]
        [::std::mem::offset_of!(TIFFHeaderBig, tiff_version) - 2usize];
    ["Offset of field: TIFFHeaderBig::tiff_offsetsize"]
        [::std::mem::offset_of!(TIFFHeaderBig, tiff_offsetsize) - 4usize];
    ["Offset of field: TIFFHeaderBig::tiff_unused"]
        [::std::mem::offset_of!(TIFFHeaderBig, tiff_unused) - 6usize];
    ["Offset of field: TIFFHeaderBig::tiff_diroff"]
        [::std::mem::offset_of!(TIFFHeaderBig, tiff_diroff) - 8usize];
};
pub const TIFFDataType_TIFF_NOTYPE: TIFFDataType = 0;
pub const TIFFDataType_TIFF_BYTE: TIFFDataType = 1;
pub const TIFFDataType_TIFF_ASCII: TIFFDataType = 2;
pub const TIFFDataType_TIFF_SHORT: TIFFDataType = 3;
pub const TIFFDataType_TIFF_LONG: TIFFDataType = 4;
pub const TIFFDataType_TIFF_RATIONAL: TIFFDataType = 5;
pub const TIFFDataType_TIFF_SBYTE: TIFFDataType = 6;
pub const TIFFDataType_TIFF_UNDEFINED: TIFFDataType = 7;
pub const TIFFDataType_TIFF_SSHORT: TIFFDataType = 8;
pub const TIFFDataType_TIFF_SLONG: TIFFDataType = 9;
pub const TIFFDataType_TIFF_SRATIONAL: TIFFDataType = 10;
pub const TIFFDataType_TIFF_FLOAT: TIFFDataType = 11;
pub const TIFFDataType_TIFF_DOUBLE: TIFFDataType = 12;
pub const TIFFDataType_TIFF_IFD: TIFFDataType = 13;
pub const TIFFDataType_TIFF_LONG8: TIFFDataType = 16;
pub const TIFFDataType_TIFF_SLONG8: TIFFDataType = 17;
pub const TIFFDataType_TIFF_IFD8: TIFFDataType = 18;
pub type TIFFDataType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tiff {
    _unused: [u8; 0],
}
pub type TIFF = tiff;
pub type tmsize_t = i64;
pub type toff_t = u64;
pub type tdir_t = u32;
pub type ttag_t = u32;
pub type tsample_t = u16;
pub type tstrile_t = u32;
pub type tstrip_t = tstrile_t;
pub type ttile_t = tstrile_t;
pub type tsize_t = tmsize_t;
pub type tdata_t = *mut ::std::os::raw::c_void;
pub type thandle_t = *mut ::std::os::raw::c_void;
pub type TIFFRGBValue = ::std::os::raw::c_uchar;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TIFFDisplay {
    pub d_mat: [[f32; 3usize]; 3usize],
    pub d_YCR: f32,
    pub d_YCG: f32,
    pub d_YCB: f32,
    pub d_Vrwr: u32,
    pub d_Vrwg: u32,
    pub d_Vrwb: u32,
    pub d_Y0R: f32,
    pub d_Y0G: f32,
    pub d_Y0B: f32,
    pub d_gammaR: f32,
    pub d_gammaG: f32,
    pub d_gammaB: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TIFFDisplay"][::std::mem::size_of::<TIFFDisplay>() - 84usize];
    ["Alignment of TIFFDisplay"][::std::mem::align_of::<TIFFDisplay>() - 4usize];
    ["Offset of field: TIFFDisplay::d_mat"][::std::mem::offset_of!(TIFFDisplay, d_mat) - 0usize];
    ["Offset of field: TIFFDisplay::d_YCR"][::std::mem::offset_of!(TIFFDisplay, d_YCR) - 36usize];
    ["Offset of field: TIFFDisplay::d_YCG"][::std::mem::offset_of!(TIFFDisplay, d_YCG) - 40usize];
    ["Offset of field: TIFFDisplay::d_YCB"][::std::mem::offset_of!(TIFFDisplay, d_YCB) - 44usize];
    ["Offset of field: TIFFDisplay::d_Vrwr"][::std::mem::offset_of!(TIFFDisplay, d_Vrwr) - 48usize];
    ["Offset of field: TIFFDisplay::d_Vrwg"][::std::mem::offset_of!(TIFFDisplay, d_Vrwg) - 52usize];
    ["Offset of field: TIFFDisplay::d_Vrwb"][::std::mem::offset_of!(TIFFDisplay, d_Vrwb) - 56usize];
    ["Offset of field: TIFFDisplay::d_Y0R"][::std::mem::offset_of!(TIFFDisplay, d_Y0R) - 60usize];
    ["Offset of field: TIFFDisplay::d_Y0G"][::std::mem::offset_of!(TIFFDisplay, d_Y0G) - 64usize];
    ["Offset of field: TIFFDisplay::d_Y0B"][::std::mem::offset_of!(TIFFDisplay, d_Y0B) - 68usize];
    ["Offset of field: TIFFDisplay::d_gammaR"]
        [::std::mem::offset_of!(TIFFDisplay, d_gammaR) - 72usize];
    ["Offset of field: TIFFDisplay::d_gammaG"]
        [::std::mem::offset_of!(TIFFDisplay, d_gammaG) - 76usize];
    ["Offset of field: TIFFDisplay::d_gammaB"]
        [::std::mem::offset_of!(TIFFDisplay, d_gammaB) - 80usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TIFFYCbCrToRGB {
    pub clamptab: *mut TIFFRGBValue,
    pub Cr_r_tab: *mut ::std::os::raw::c_int,
    pub Cb_b_tab: *mut ::std::os::raw::c_int,
    pub Cr_g_tab: *mut i32,
    pub Cb_g_tab: *mut i32,
    pub Y_tab: *mut i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TIFFYCbCrToRGB"][::std::mem::size_of::<TIFFYCbCrToRGB>() - 48usize];
    ["Alignment of TIFFYCbCrToRGB"][::std::mem::align_of::<TIFFYCbCrToRGB>() - 8usize];
    ["Offset of field: TIFFYCbCrToRGB::clamptab"]
        [::std::mem::offset_of!(TIFFYCbCrToRGB, clamptab) - 0usize];
    ["Offset of field: TIFFYCbCrToRGB::Cr_r_tab"]
        [::std::mem::offset_of!(TIFFYCbCrToRGB, Cr_r_tab) - 8usize];
    ["Offset of field: TIFFYCbCrToRGB::Cb_b_tab"]
        [::std::mem::offset_of!(TIFFYCbCrToRGB, Cb_b_tab) - 16usize];
    ["Offset of field: TIFFYCbCrToRGB::Cr_g_tab"]
        [::std::mem::offset_of!(TIFFYCbCrToRGB, Cr_g_tab) - 24usize];
    ["Offset of field: TIFFYCbCrToRGB::Cb_g_tab"]
        [::std::mem::offset_of!(TIFFYCbCrToRGB, Cb_g_tab) - 32usize];
    ["Offset of field: TIFFYCbCrToRGB::Y_tab"]
        [::std::mem::offset_of!(TIFFYCbCrToRGB, Y_tab) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TIFFCIELabToRGB {
    pub range: ::std::os::raw::c_int,
    pub rstep: f32,
    pub gstep: f32,
    pub bstep: f32,
    pub X0: f32,
    pub Y0: f32,
    pub Z0: f32,
    pub display: TIFFDisplay,
    pub Yr2r: [f32; 1501usize],
    pub Yg2g: [f32; 1501usize],
    pub Yb2b: [f32; 1501usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TIFFCIELabToRGB"][::std::mem::size_of::<TIFFCIELabToRGB>() - 18124usize];
    ["Alignment of TIFFCIELabToRGB"][::std::mem::align_of::<TIFFCIELabToRGB>() - 4usize];
    ["Offset of field: TIFFCIELabToRGB::range"]
        [::std::mem::offset_of!(TIFFCIELabToRGB, range) - 0usize];
    ["Offset of field: TIFFCIELabToRGB::rstep"]
        [::std::mem::offset_of!(TIFFCIELabToRGB, rstep) - 4usize];
    ["Offset of field: TIFFCIELabToRGB::gstep"]
        [::std::mem::offset_of!(TIFFCIELabToRGB, gstep) - 8usize];
    ["Offset of field: TIFFCIELabToRGB::bstep"]
        [::std::mem::offset_of!(TIFFCIELabToRGB, bstep) - 12usize];
    ["Offset of field: TIFFCIELabToRGB::X0"][::std::mem::offset_of!(TIFFCIELabToRGB, X0) - 16usize];
    ["Offset of field: TIFFCIELabToRGB::Y0"][::std::mem::offset_of!(TIFFCIELabToRGB, Y0) - 20usize];
    ["Offset of field: TIFFCIELabToRGB::Z0"][::std::mem::offset_of!(TIFFCIELabToRGB, Z0) - 24usize];
    ["Offset of field: TIFFCIELabToRGB::display"]
        [::std::mem::offset_of!(TIFFCIELabToRGB, display) - 28usize];
    ["Offset of field: TIFFCIELabToRGB::Yr2r"]
        [::std::mem::offset_of!(TIFFCIELabToRGB, Yr2r) - 112usize];
    ["Offset of field: TIFFCIELabToRGB::Yg2g"]
        [::std::mem::offset_of!(TIFFCIELabToRGB, Yg2g) - 6116usize];
    ["Offset of field: TIFFCIELabToRGB::Yb2b"]
        [::std::mem::offset_of!(TIFFCIELabToRGB, Yb2b) - 12120usize];
};
pub type TIFFRGBAImage = _TIFFRGBAImage;
pub type tileContigRoutine = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut TIFFRGBAImage,
        arg2: *mut u32,
        arg3: u32,
        arg4: u32,
        arg5: u32,
        arg6: u32,
        arg7: i32,
        arg8: i32,
        arg9: *mut ::std::os::raw::c_uchar,
    ),
>;
pub type tileSeparateRoutine = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut TIFFRGBAImage,
        arg2: *mut u32,
        arg3: u32,
        arg4: u32,
        arg5: u32,
        arg6: u32,
        arg7: i32,
        arg8: i32,
        arg9: *mut ::std::os::raw::c_uchar,
        arg10: *mut ::std::os::raw::c_uchar,
        arg11: *mut ::std::os::raw::c_uchar,
        arg12: *mut ::std::os::raw::c_uchar,
    ),
>;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _TIFFRGBAImage {
    pub tif: *mut TIFF,
    pub stoponerr: ::std::os::raw::c_int,
    pub isContig: ::std::os::raw::c_int,
    pub alpha: ::std::os::raw::c_int,
    pub width: u32,
    pub height: u32,
    pub bitspersample: u16,
    pub samplesperpixel: u16,
    pub orientation: u16,
    pub req_orientation: u16,
    pub photometric: u16,
    pub redcmap: *mut u16,
    pub greencmap: *mut u16,
    pub bluecmap: *mut u16,
    pub get: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut TIFFRGBAImage,
            arg2: *mut u32,
            arg3: u32,
            arg4: u32,
        ) -> ::std::os::raw::c_int,
    >,
    pub put: _TIFFRGBAImage__bindgen_ty_1,
    pub Map: *mut TIFFRGBValue,
    pub BWmap: *mut *mut u32,
    pub PALmap: *mut *mut u32,
    pub ycbcr: *mut TIFFYCbCrToRGB,
    pub cielab: *mut TIFFCIELabToRGB,
    pub UaToAa: *mut u8,
    pub Bitdepth16To8: *mut u8,
    pub row_offset: ::std::os::raw::c_int,
    pub col_offset: ::std::os::raw::c_int,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _TIFFRGBAImage__bindgen_ty_1 {
    pub any: ::std::option::Option<unsafe extern "C" fn(arg1: *mut TIFFRGBAImage)>,
    pub contig: tileContigRoutine,
    pub separate: tileSeparateRoutine,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _TIFFRGBAImage__bindgen_ty_1"]
        [::std::mem::size_of::<_TIFFRGBAImage__bindgen_ty_1>() - 8usize];
    ["Alignment of _TIFFRGBAImage__bindgen_ty_1"]
        [::std::mem::align_of::<_TIFFRGBAImage__bindgen_ty_1>() - 8usize];
    ["Offset of field: _TIFFRGBAImage__bindgen_ty_1::any"]
        [::std::mem::offset_of!(_TIFFRGBAImage__bindgen_ty_1, any) - 0usize];
    ["Offset of field: _TIFFRGBAImage__bindgen_ty_1::contig"]
        [::std::mem::offset_of!(_TIFFRGBAImage__bindgen_ty_1, contig) - 0usize];
    ["Offset of field: _TIFFRGBAImage__bindgen_ty_1::separate"]
        [::std::mem::offset_of!(_TIFFRGBAImage__bindgen_ty_1, separate) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _TIFFRGBAImage"][::std::mem::size_of::<_TIFFRGBAImage>() - 144usize];
    ["Alignment of _TIFFRGBAImage"][::std::mem::align_of::<_TIFFRGBAImage>() - 8usize];
    ["Offset of field: _TIFFRGBAImage::tif"][::std::mem::offset_of!(_TIFFRGBAImage, tif) - 0usize];
    ["Offset of field: _TIFFRGBAImage::stoponerr"]
        [::std::mem::offset_of!(_TIFFRGBAImage, stoponerr) - 8usize];
    ["Offset of field: _TIFFRGBAImage::isContig"]
        [::std::mem::offset_of!(_TIFFRGBAImage, isContig) - 12usize];
    ["Offset of field: _TIFFRGBAImage::alpha"]
        [::std::mem::offset_of!(_TIFFRGBAImage, alpha) - 16usize];
    ["Offset of field: _TIFFRGBAImage::width"]
        [::std::mem::offset_of!(_TIFFRGBAImage, width) - 20usize];
    ["Offset of field: _TIFFRGBAImage::height"]
        [::std::mem::offset_of!(_TIFFRGBAImage, height) - 24usize];
    ["Offset of field: _TIFFRGBAImage::bitspersample"]
        [::std::mem::offset_of!(_TIFFRGBAImage, bitspersample) - 28usize];
    ["Offset of field: _TIFFRGBAImage::samplesperpixel"]
        [::std::mem::offset_of!(_TIFFRGBAImage, samplesperpixel) - 30usize];
    ["Offset of field: _TIFFRGBAImage::orientation"]
        [::std::mem::offset_of!(_TIFFRGBAImage, orientation) - 32usize];
    ["Offset of field: _TIFFRGBAImage::req_orientation"]
        [::std::mem::offset_of!(_TIFFRGBAImage, req_orientation) - 34usize];
    ["Offset of field: _TIFFRGBAImage::photometric"]
        [::std::mem::offset_of!(_TIFFRGBAImage, photometric) - 36usize];
    ["Offset of field: _TIFFRGBAImage::redcmap"]
        [::std::mem::offset_of!(_TIFFRGBAImage, redcmap) - 40usize];
    ["Offset of field: _TIFFRGBAImage::greencmap"]
        [::std::mem::offset_of!(_TIFFRGBAImage, greencmap) - 48usize];
    ["Offset of field: _TIFFRGBAImage::bluecmap"]
        [::std::mem::offset_of!(_TIFFRGBAImage, bluecmap) - 56usize];
    ["Offset of field: _TIFFRGBAImage::get"][::std::mem::offset_of!(_TIFFRGBAImage, get) - 64usize];
    ["Offset of field: _TIFFRGBAImage::put"][::std::mem::offset_of!(_TIFFRGBAImage, put) - 72usize];
    ["Offset of field: _TIFFRGBAImage::Map"][::std::mem::offset_of!(_TIFFRGBAImage, Map) - 80usize];
    ["Offset of field: _TIFFRGBAImage::BWmap"]
        [::std::mem::offset_of!(_TIFFRGBAImage, BWmap) - 88usize];
    ["Offset of field: _TIFFRGBAImage::PALmap"]
        [::std::mem::offset_of!(_TIFFRGBAImage, PALmap) - 96usize];
    ["Offset of field: _TIFFRGBAImage::ycbcr"]
        [::std::mem::offset_of!(_TIFFRGBAImage, ycbcr) - 104usize];
    ["Offset of field: _TIFFRGBAImage::cielab"]
        [::std::mem::offset_of!(_TIFFRGBAImage, cielab) - 112usize];
    ["Offset of field: _TIFFRGBAImage::UaToAa"]
        [::std::mem::offset_of!(_TIFFRGBAImage, UaToAa) - 120usize];
    ["Offset of field: _TIFFRGBAImage::Bitdepth16To8"]
        [::std::mem::offset_of!(_TIFFRGBAImage, Bitdepth16To8) - 128usize];
    ["Offset of field: _TIFFRGBAImage::row_offset"]
        [::std::mem::offset_of!(_TIFFRGBAImage, row_offset) - 136usize];
    ["Offset of field: _TIFFRGBAImage::col_offset"]
        [::std::mem::offset_of!(_TIFFRGBAImage, col_offset) - 140usize];
};
pub type TIFFInitMethod = ::std::option::Option<
    unsafe extern "C" fn(arg1: *mut TIFF, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TIFFCodec {
    pub name: *mut ::std::os::raw::c_char,
    pub scheme: u16,
    pub init: TIFFInitMethod,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TIFFCodec"][::std::mem::size_of::<TIFFCodec>() - 24usize];
    ["Alignment of TIFFCodec"][::std::mem::align_of::<TIFFCodec>() - 8usize];
    ["Offset of field: TIFFCodec::name"][::std::mem::offset_of!(TIFFCodec, name) - 0usize];
    ["Offset of field: TIFFCodec::scheme"][::std::mem::offset_of!(TIFFCodec, scheme) - 8usize];
    ["Offset of field: TIFFCodec::init"][::std::mem::offset_of!(TIFFCodec, init) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TIFFRational_t {
    pub uNum: u32,
    pub uDenom: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TIFFRational_t"][::std::mem::size_of::<TIFFRational_t>() - 8usize];
    ["Alignment of TIFFRational_t"][::std::mem::align_of::<TIFFRational_t>() - 4usize];
    ["Offset of field: TIFFRational_t::uNum"]
        [::std::mem::offset_of!(TIFFRational_t, uNum) - 0usize];
    ["Offset of field: TIFFRational_t::uDenom"]
        [::std::mem::offset_of!(TIFFRational_t, uDenom) - 4usize];
};
pub type __gnuc_va_list = __builtin_va_list;
pub type va_list = __builtin_va_list;
pub type u_int8_t = ::std::os::raw::c_uchar;
pub type u_int16_t = ::std::os::raw::c_ushort;
pub type u_int32_t = ::std::os::raw::c_uint;
pub type u_int64_t = ::std::os::raw::c_ulonglong;
pub type register_t = i64;
pub type user_addr_t = u_int64_t;
pub type user_size_t = u_int64_t;
pub type user_ssize_t = i64;
pub type user_long_t = i64;
pub type user_ulong_t = u_int64_t;
pub type user_time_t = i64;
pub type user_off_t = i64;
pub type syscall_arg_t = u_int64_t;
unsafe extern "C" {
    pub fn renameat(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        arg4: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn renamex_np(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn renameatx_np(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        arg4: *const ::std::os::raw::c_char,
        arg5: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn printf(arg1: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
pub type fpos_t = __darwin_off_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sbuf {
    pub _base: *mut ::std::os::raw::c_uchar,
    pub _size: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sbuf"][::std::mem::size_of::<__sbuf>() - 16usize];
    ["Alignment of __sbuf"][::std::mem::align_of::<__sbuf>() - 8usize];
    ["Offset of field: __sbuf::_base"][::std::mem::offset_of!(__sbuf, _base) - 0usize];
    ["Offset of field: __sbuf::_size"][::std::mem::offset_of!(__sbuf, _size) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sFILEX {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sFILE {
    pub _p: *mut ::std::os::raw::c_uchar,
    pub _r: ::std::os::raw::c_int,
    pub _w: ::std::os::raw::c_int,
    pub _flags: ::std::os::raw::c_short,
    pub _file: ::std::os::raw::c_short,
    pub _bf: __sbuf,
    pub _lbfsize: ::std::os::raw::c_int,
    pub _cookie: *mut ::std::os::raw::c_void,
    pub _close: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
    >,
    pub _read: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *mut ::std::os::raw::c_char,
            __n: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub _seek: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: fpos_t,
            arg3: ::std::os::raw::c_int,
        ) -> fpos_t,
    >,
    pub _write: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *const ::std::os::raw::c_char,
            __n: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub _ub: __sbuf,
    pub _extra: *mut __sFILEX,
    pub _ur: ::std::os::raw::c_int,
    pub _ubuf: [::std::os::raw::c_uchar; 3usize],
    pub _nbuf: [::std::os::raw::c_uchar; 1usize],
    pub _lb: __sbuf,
    pub _blksize: ::std::os::raw::c_int,
    pub _offset: fpos_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sFILE"][::std::mem::size_of::<__sFILE>() - 152usize];
    ["Alignment of __sFILE"][::std::mem::align_of::<__sFILE>() - 8usize];
    ["Offset of field: __sFILE::_p"][::std::mem::offset_of!(__sFILE, _p) - 0usize];
    ["Offset of field: __sFILE::_r"][::std::mem::offset_of!(__sFILE, _r) - 8usize];
    ["Offset of field: __sFILE::_w"][::std::mem::offset_of!(__sFILE, _w) - 12usize];
    ["Offset of field: __sFILE::_flags"][::std::mem::offset_of!(__sFILE, _flags) - 16usize];
    ["Offset of field: __sFILE::_file"][::std::mem::offset_of!(__sFILE, _file) - 18usize];
    ["Offset of field: __sFILE::_bf"][::std::mem::offset_of!(__sFILE, _bf) - 24usize];
    ["Offset of field: __sFILE::_lbfsize"][::std::mem::offset_of!(__sFILE, _lbfsize) - 40usize];
    ["Offset of field: __sFILE::_cookie"][::std::mem::offset_of!(__sFILE, _cookie) - 48usize];
    ["Offset of field: __sFILE::_close"][::std::mem::offset_of!(__sFILE, _close) - 56usize];
    ["Offset of field: __sFILE::_read"][::std::mem::offset_of!(__sFILE, _read) - 64usize];
    ["Offset of field: __sFILE::_seek"][::std::mem::offset_of!(__sFILE, _seek) - 72usize];
    ["Offset of field: __sFILE::_write"][::std::mem::offset_of!(__sFILE, _write) - 80usize];
    ["Offset of field: __sFILE::_ub"][::std::mem::offset_of!(__sFILE, _ub) - 88usize];
    ["Offset of field: __sFILE::_extra"][::std::mem::offset_of!(__sFILE, _extra) - 104usize];
    ["Offset of field: __sFILE::_ur"][::std::mem::offset_of!(__sFILE, _ur) - 112usize];
    ["Offset of field: __sFILE::_ubuf"][::std::mem::offset_of!(__sFILE, _ubuf) - 116usize];
    ["Offset of field: __sFILE::_nbuf"][::std::mem::offset_of!(__sFILE, _nbuf) - 119usize];
    ["Offset of field: __sFILE::_lb"][::std::mem::offset_of!(__sFILE, _lb) - 120usize];
    ["Offset of field: __sFILE::_blksize"][::std::mem::offset_of!(__sFILE, _blksize) - 136usize];
    ["Offset of field: __sFILE::_offset"][::std::mem::offset_of!(__sFILE, _offset) - 144usize];
};
pub type FILE = __sFILE;
unsafe extern "C" {
    pub static mut __stdinp: *mut FILE;
}
unsafe extern "C" {
    pub static mut __stdoutp: *mut FILE;
}
unsafe extern "C" {
    pub static mut __stderrp: *mut FILE;
}
unsafe extern "C" {
    pub fn clearerr(arg1: *mut FILE);
}
unsafe extern "C" {
    pub fn fclose(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn feof(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ferror(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fflush(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fgetc(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fgetpos(arg1: *mut FILE, arg2: *mut fpos_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fgets(
        arg1: *mut ::std::os::raw::c_char,
        __size: ::std::os::raw::c_int,
        arg2: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn fopen(
        __filename: *const ::std::os::raw::c_char,
        __mode: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn fprintf(
        arg1: *mut FILE,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fputc(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fputs(arg1: *const ::std::os::raw::c_char, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fread(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __nitems: ::std::os::raw::c_ulong,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn freopen(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut FILE,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn fscanf(
        arg1: *mut FILE,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fseek(
        arg1: *mut FILE,
        arg2: ::std::os::raw::c_long,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fsetpos(arg1: *mut FILE, arg2: *const fpos_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ftell(arg1: *mut FILE) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn fwrite(
        __ptr: *const ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __nitems: ::std::os::raw::c_ulong,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn getc(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn gets(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn perror(arg1: *const ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn putc(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putchar(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn puts(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn remove(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn rename(
        __old: *const ::std::os::raw::c_char,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn rewind(arg1: *mut FILE);
}
unsafe extern "C" {
    pub fn scanf(arg1: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setbuf(arg1: *mut FILE, arg2: *mut ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn setvbuf(
        arg1: *mut FILE,
        arg2: *mut ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        __size: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sprintf(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sscanf(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
unsafe extern "C" {
    pub fn tmpnam(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ungetc(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vfprintf(
        arg1: *mut FILE,
        arg2: *const ::std::os::raw::c_char,
        arg3: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vprintf(
        arg1: *const ::std::os::raw::c_char,
        arg2: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vsprintf(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ctermid(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn fdopen(arg1: ::std::os::raw::c_int, arg2: *const ::std::os::raw::c_char) -> *mut FILE;
}
unsafe extern "C" {
    pub fn fileno(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pclose(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn popen(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn __srget(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __svfscanf(
        arg1: *mut FILE,
        arg2: *const ::std::os::raw::c_char,
        arg3: va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __swbuf(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn flockfile(arg1: *mut FILE);
}
unsafe extern "C" {
    pub fn ftrylockfile(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn funlockfile(arg1: *mut FILE);
}
unsafe extern "C" {
    pub fn getc_unlocked(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getchar_unlocked() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putc_unlocked(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putchar_unlocked(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getw(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putw(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn tempnam(
        __dir: *const ::std::os::raw::c_char,
        __prefix: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
pub type off_t = __darwin_off_t;
unsafe extern "C" {
    pub fn fseeko(
        __stream: *mut FILE,
        __offset: off_t,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ftello(__stream: *mut FILE) -> off_t;
}
unsafe extern "C" {
    pub fn snprintf(
        __str: *mut ::std::os::raw::c_char,
        __size: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vfscanf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        arg1: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vscanf(
        __format: *const ::std::os::raw::c_char,
        arg1: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vsnprintf(
        __str: *mut ::std::os::raw::c_char,
        __size: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        arg1: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vsscanf(
        __str: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        arg1: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn dprintf(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vdprintf(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getdelim(
        __linep: *mut *mut ::std::os::raw::c_char,
        __linecapp: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> isize;
}
unsafe extern "C" {
    pub fn getline(
        __linep: *mut *mut ::std::os::raw::c_char,
        __linecapp: *mut usize,
        __stream: *mut FILE,
    ) -> isize;
}
unsafe extern "C" {
    pub fn fmemopen(
        __buf: *mut ::std::os::raw::c_void,
        __size: usize,
        __mode: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn open_memstream(
        __bufp: *mut *mut ::std::os::raw::c_char,
        __sizep: *mut usize,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub static sys_nerr: ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub static sys_errlist: [*const ::std::os::raw::c_char; 0usize];
}
unsafe extern "C" {
    pub fn asprintf(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ctermid_r(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn fgetln(arg1: *mut FILE, __len: *mut usize) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn fmtcheck(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn fpurge(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setbuffer(
        arg1: *mut FILE,
        arg2: *mut ::std::os::raw::c_char,
        __size: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    pub fn setlinebuf(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vasprintf(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn funopen(
        arg1: *const ::std::os::raw::c_void,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: *mut ::std::os::raw::c_char,
                __n: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_int,
        >,
        arg3: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: *const ::std::os::raw::c_char,
                __n: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_int,
        >,
        arg4: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: fpos_t,
                arg3: ::std::os::raw::c_int,
            ) -> fpos_t,
        >,
        arg5: ::std::option::Option<
            unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
        >,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn __snprintf_chk(
        arg1: *mut ::std::os::raw::c_char,
        __maxlen: usize,
        arg2: ::std::os::raw::c_int,
        arg3: usize,
        arg4: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __vsnprintf_chk(
        arg1: *mut ::std::os::raw::c_char,
        __maxlen: usize,
        arg2: ::std::os::raw::c_int,
        arg3: usize,
        arg4: *const ::std::os::raw::c_char,
        arg5: va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __sprintf_chk(
        arg1: *mut ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
        arg3: usize,
        arg4: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __vsprintf_chk(
        arg1: *mut ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
        arg3: usize,
        arg4: *const ::std::os::raw::c_char,
        arg5: va_list,
    ) -> ::std::os::raw::c_int;
}
pub type TIFFErrorHandler = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: va_list,
    ),
>;
pub type TIFFErrorHandlerExt = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: thandle_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *const ::std::os::raw::c_char,
        arg4: va_list,
    ),
>;
pub type TIFFErrorHandlerExtR = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut TIFF,
        user_data: *mut ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_char,
        arg3: *const ::std::os::raw::c_char,
        arg4: va_list,
    ) -> ::std::os::raw::c_int,
>;
pub type TIFFReadWriteProc = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: thandle_t,
        arg2: *mut ::std::os::raw::c_void,
        arg3: tmsize_t,
    ) -> tmsize_t,
>;
pub type TIFFSeekProc = ::std::option::Option<
    unsafe extern "C" fn(arg1: thandle_t, arg2: toff_t, arg3: ::std::os::raw::c_int) -> toff_t,
>;
pub type TIFFCloseProc =
    ::std::option::Option<unsafe extern "C" fn(arg1: thandle_t) -> ::std::os::raw::c_int>;
pub type TIFFSizeProc = ::std::option::Option<unsafe extern "C" fn(arg1: thandle_t) -> toff_t>;
pub type TIFFMapFileProc = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: thandle_t,
        base: *mut *mut ::std::os::raw::c_void,
        size: *mut toff_t,
    ) -> ::std::os::raw::c_int,
>;
pub type TIFFUnmapFileProc = ::std::option::Option<
    unsafe extern "C" fn(arg1: thandle_t, base: *mut ::std::os::raw::c_void, size: toff_t),
>;
pub type TIFFExtendProc = ::std::option::Option<unsafe extern "C" fn(arg1: *mut TIFF)>;
unsafe extern "C" {
    pub fn TIFFGetVersion() -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn TIFFFindCODEC(arg1: u16) -> *const TIFFCodec;
}
unsafe extern "C" {
    pub fn TIFFRegisterCODEC(
        arg1: u16,
        arg2: *const ::std::os::raw::c_char,
        arg3: TIFFInitMethod,
    ) -> *mut TIFFCodec;
}
unsafe extern "C" {
    pub fn TIFFUnRegisterCODEC(arg1: *mut TIFFCodec);
}
unsafe extern "C" {
    pub fn TIFFIsCODECConfigured(arg1: u16) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFGetConfiguredCODECs() -> *mut TIFFCodec;
}
unsafe extern "C" {
    pub fn _TIFFmalloc(s: tmsize_t) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _TIFFcalloc(nmemb: tmsize_t, siz: tmsize_t) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _TIFFrealloc(p: *mut ::std::os::raw::c_void, s: tmsize_t)
        -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _TIFFfree(p: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn _TIFFmemset(p: *mut ::std::os::raw::c_void, v: ::std::os::raw::c_int, c: tmsize_t);
}
unsafe extern "C" {
    pub fn _TIFFmemcpy(
        d: *mut ::std::os::raw::c_void,
        s: *const ::std::os::raw::c_void,
        c: tmsize_t,
    );
}
unsafe extern "C" {
    pub fn _TIFFmemcmp(
        p1: *const ::std::os::raw::c_void,
        p2: *const ::std::os::raw::c_void,
        c: tmsize_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFGetTagListCount(arg1: *mut TIFF) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFGetTagListEntry(arg1: *mut TIFF, tag_index: ::std::os::raw::c_int) -> u32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _TIFFField {
    _unused: [u8; 0],
}
pub type TIFFField = _TIFFField;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _TIFFFieldArray {
    _unused: [u8; 0],
}
pub type TIFFFieldArray = _TIFFFieldArray;
unsafe extern "C" {
    pub fn TIFFFindField(arg1: *mut TIFF, arg2: u32, arg3: TIFFDataType) -> *const TIFFField;
}
unsafe extern "C" {
    pub fn TIFFFieldWithTag(arg1: *mut TIFF, arg2: u32) -> *const TIFFField;
}
unsafe extern "C" {
    pub fn TIFFFieldWithName(
        arg1: *mut TIFF,
        arg2: *const ::std::os::raw::c_char,
    ) -> *const TIFFField;
}
unsafe extern "C" {
    pub fn TIFFFieldTag(arg1: *const TIFFField) -> u32;
}
unsafe extern "C" {
    pub fn TIFFFieldName(arg1: *const TIFFField) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn TIFFFieldDataType(arg1: *const TIFFField) -> TIFFDataType;
}
unsafe extern "C" {
    pub fn TIFFFieldPassCount(arg1: *const TIFFField) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFFieldReadCount(arg1: *const TIFFField) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFFieldWriteCount(arg1: *const TIFFField) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFFieldSetGetSize(arg1: *const TIFFField) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFFieldSetGetCountSize(arg1: *const TIFFField) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFFieldIsAnonymous(arg1: *const TIFFField) -> ::std::os::raw::c_int;
}
pub type TIFFVSetMethod = ::std::option::Option<
    unsafe extern "C" fn(arg1: *mut TIFF, arg2: u32, arg3: va_list) -> ::std::os::raw::c_int,
>;
pub type TIFFVGetMethod = ::std::option::Option<
    unsafe extern "C" fn(arg1: *mut TIFF, arg2: u32, arg3: va_list) -> ::std::os::raw::c_int,
>;
pub type TIFFPrintMethod = ::std::option::Option<
    unsafe extern "C" fn(arg1: *mut TIFF, arg2: *mut FILE, arg3: ::std::os::raw::c_long),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TIFFTagMethods {
    pub vsetfield: TIFFVSetMethod,
    pub vgetfield: TIFFVGetMethod,
    pub printdir: TIFFPrintMethod,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TIFFTagMethods"][::std::mem::size_of::<TIFFTagMethods>() - 24usize];
    ["Alignment of TIFFTagMethods"][::std::mem::align_of::<TIFFTagMethods>() - 8usize];
    ["Offset of field: TIFFTagMethods::vsetfield"]
        [::std::mem::offset_of!(TIFFTagMethods, vsetfield) - 0usize];
    ["Offset of field: TIFFTagMethods::vgetfield"]
        [::std::mem::offset_of!(TIFFTagMethods, vgetfield) - 8usize];
    ["Offset of field: TIFFTagMethods::printdir"]
        [::std::mem::offset_of!(TIFFTagMethods, printdir) - 16usize];
};
unsafe extern "C" {
    pub fn TIFFAccessTagMethods(arg1: *mut TIFF) -> *mut TIFFTagMethods;
}
unsafe extern "C" {
    pub fn TIFFGetClientInfo(
        arg1: *mut TIFF,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn TIFFSetClientInfo(
        arg1: *mut TIFF,
        arg2: *mut ::std::os::raw::c_void,
        arg3: *const ::std::os::raw::c_char,
    );
}
unsafe extern "C" {
    pub fn TIFFCleanup(tif: *mut TIFF);
}
unsafe extern "C" {
    pub fn TIFFClose(tif: *mut TIFF);
}
unsafe extern "C" {
    pub fn TIFFFlush(tif: *mut TIFF) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFFlushData(tif: *mut TIFF) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFGetField(tif: *mut TIFF, tag: u32, ...) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFVGetField(tif: *mut TIFF, tag: u32, ap: va_list) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFGetFieldDefaulted(tif: *mut TIFF, tag: u32, ...) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFVGetFieldDefaulted(tif: *mut TIFF, tag: u32, ap: va_list) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFReadDirectory(tif: *mut TIFF) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFReadCustomDirectory(
        tif: *mut TIFF,
        diroff: toff_t,
        infoarray: *const TIFFFieldArray,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFReadEXIFDirectory(tif: *mut TIFF, diroff: toff_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFReadGPSDirectory(tif: *mut TIFF, diroff: toff_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFScanlineSize64(tif: *mut TIFF) -> u64;
}
unsafe extern "C" {
    pub fn TIFFScanlineSize(tif: *mut TIFF) -> tmsize_t;
}
unsafe extern "C" {
    pub fn TIFFRasterScanlineSize64(tif: *mut TIFF) -> u64;
}
unsafe extern "C" {
    pub fn TIFFRasterScanlineSize(tif: *mut TIFF) -> tmsize_t;
}
unsafe extern "C" {
    pub fn TIFFStripSize64(tif: *mut TIFF) -> u64;
}
unsafe extern "C" {
    pub fn TIFFStripSize(tif: *mut TIFF) -> tmsize_t;
}
unsafe extern "C" {
    pub fn TIFFRawStripSize64(tif: *mut TIFF, strip: u32) -> u64;
}
unsafe extern "C" {
    pub fn TIFFRawStripSize(tif: *mut TIFF, strip: u32) -> tmsize_t;
}
unsafe extern "C" {
    pub fn TIFFVStripSize64(tif: *mut TIFF, nrows: u32) -> u64;
}
unsafe extern "C" {
    pub fn TIFFVStripSize(tif: *mut TIFF, nrows: u32) -> tmsize_t;
}
unsafe extern "C" {
    pub fn TIFFTileRowSize64(tif: *mut TIFF) -> u64;
}
unsafe extern "C" {
    pub fn TIFFTileRowSize(tif: *mut TIFF) -> tmsize_t;
}
unsafe extern "C" {
    pub fn TIFFTileSize64(tif: *mut TIFF) -> u64;
}
unsafe extern "C" {
    pub fn TIFFTileSize(tif: *mut TIFF) -> tmsize_t;
}
unsafe extern "C" {
    pub fn TIFFVTileSize64(tif: *mut TIFF, nrows: u32) -> u64;
}
unsafe extern "C" {
    pub fn TIFFVTileSize(tif: *mut TIFF, nrows: u32) -> tmsize_t;
}
unsafe extern "C" {
    pub fn TIFFDefaultStripSize(tif: *mut TIFF, request: u32) -> u32;
}
unsafe extern "C" {
    pub fn TIFFDefaultTileSize(arg1: *mut TIFF, arg2: *mut u32, arg3: *mut u32);
}
unsafe extern "C" {
    pub fn TIFFFileno(arg1: *mut TIFF) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFSetFileno(arg1: *mut TIFF, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFClientdata(arg1: *mut TIFF) -> thandle_t;
}
unsafe extern "C" {
    pub fn TIFFSetClientdata(arg1: *mut TIFF, arg2: thandle_t) -> thandle_t;
}
unsafe extern "C" {
    pub fn TIFFGetMode(arg1: *mut TIFF) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFSetMode(arg1: *mut TIFF, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFIsTiled(arg1: *mut TIFF) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFIsByteSwapped(arg1: *mut TIFF) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFIsUpSampled(arg1: *mut TIFF) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFIsMSB2LSB(arg1: *mut TIFF) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFIsBigEndian(arg1: *mut TIFF) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFIsBigTIFF(arg1: *mut TIFF) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFGetReadProc(arg1: *mut TIFF) -> TIFFReadWriteProc;
}
unsafe extern "C" {
    pub fn TIFFGetWriteProc(arg1: *mut TIFF) -> TIFFReadWriteProc;
}
unsafe extern "C" {
    pub fn TIFFGetSeekProc(arg1: *mut TIFF) -> TIFFSeekProc;
}
unsafe extern "C" {
    pub fn TIFFGetCloseProc(arg1: *mut TIFF) -> TIFFCloseProc;
}
unsafe extern "C" {
    pub fn TIFFGetSizeProc(arg1: *mut TIFF) -> TIFFSizeProc;
}
unsafe extern "C" {
    pub fn TIFFGetMapFileProc(arg1: *mut TIFF) -> TIFFMapFileProc;
}
unsafe extern "C" {
    pub fn TIFFGetUnmapFileProc(arg1: *mut TIFF) -> TIFFUnmapFileProc;
}
unsafe extern "C" {
    pub fn TIFFCurrentRow(arg1: *mut TIFF) -> u32;
}
unsafe extern "C" {
    pub fn TIFFCurrentDirectory(arg1: *mut TIFF) -> tdir_t;
}
unsafe extern "C" {
    pub fn TIFFNumberOfDirectories(arg1: *mut TIFF) -> tdir_t;
}
unsafe extern "C" {
    pub fn TIFFCurrentDirOffset(arg1: *mut TIFF) -> u64;
}
unsafe extern "C" {
    pub fn TIFFCurrentStrip(arg1: *mut TIFF) -> u32;
}
unsafe extern "C" {
    pub fn TIFFCurrentTile(tif: *mut TIFF) -> u32;
}
unsafe extern "C" {
    pub fn TIFFReadBufferSetup(
        tif: *mut TIFF,
        bp: *mut ::std::os::raw::c_void,
        size: tmsize_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFWriteBufferSetup(
        tif: *mut TIFF,
        bp: *mut ::std::os::raw::c_void,
        size: tmsize_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFSetupStrips(arg1: *mut TIFF) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFWriteCheck(
        arg1: *mut TIFF,
        arg2: ::std::os::raw::c_int,
        arg3: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFFreeDirectory(arg1: *mut TIFF);
}
unsafe extern "C" {
    pub fn TIFFCreateDirectory(arg1: *mut TIFF) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFCreateCustomDirectory(
        arg1: *mut TIFF,
        arg2: *const TIFFFieldArray,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFCreateEXIFDirectory(arg1: *mut TIFF) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFCreateGPSDirectory(arg1: *mut TIFF) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFLastDirectory(arg1: *mut TIFF) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFSetDirectory(arg1: *mut TIFF, arg2: tdir_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFSetSubDirectory(arg1: *mut TIFF, arg2: u64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFUnlinkDirectory(arg1: *mut TIFF, arg2: tdir_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFSetField(arg1: *mut TIFF, arg2: u32, ...) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFVSetField(arg1: *mut TIFF, arg2: u32, arg3: va_list) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFUnsetField(arg1: *mut TIFF, arg2: u32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFWriteDirectory(arg1: *mut TIFF) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFWriteCustomDirectory(arg1: *mut TIFF, arg2: *mut u64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFCheckpointDirectory(arg1: *mut TIFF) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFRewriteDirectory(arg1: *mut TIFF) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFDeferStrileArrayWriting(arg1: *mut TIFF) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFForceStrileArrayWriting(arg1: *mut TIFF) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFPrintDirectory(arg1: *mut TIFF, arg2: *mut FILE, arg3: ::std::os::raw::c_long);
}
unsafe extern "C" {
    pub fn TIFFReadScanline(
        tif: *mut TIFF,
        buf: *mut ::std::os::raw::c_void,
        row: u32,
        sample: u16,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFWriteScanline(
        tif: *mut TIFF,
        buf: *mut ::std::os::raw::c_void,
        row: u32,
        sample: u16,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFReadRGBAImage(
        arg1: *mut TIFF,
        arg2: u32,
        arg3: u32,
        arg4: *mut u32,
        arg5: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFReadRGBAImageOriented(
        arg1: *mut TIFF,
        arg2: u32,
        arg3: u32,
        arg4: *mut u32,
        arg5: ::std::os::raw::c_int,
        arg6: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFReadRGBAStrip(arg1: *mut TIFF, arg2: u32, arg3: *mut u32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFReadRGBATile(
        arg1: *mut TIFF,
        arg2: u32,
        arg3: u32,
        arg4: *mut u32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFReadRGBAStripExt(
        arg1: *mut TIFF,
        arg2: u32,
        arg3: *mut u32,
        stop_on_error: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFReadRGBATileExt(
        arg1: *mut TIFF,
        arg2: u32,
        arg3: u32,
        arg4: *mut u32,
        stop_on_error: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFRGBAImageOK(
        arg1: *mut TIFF,
        arg2: *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFRGBAImageBegin(
        arg1: *mut TIFFRGBAImage,
        arg2: *mut TIFF,
        arg3: ::std::os::raw::c_int,
        arg4: *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFRGBAImageGet(
        arg1: *mut TIFFRGBAImage,
        arg2: *mut u32,
        arg3: u32,
        arg4: u32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFRGBAImageEnd(arg1: *mut TIFFRGBAImage);
}
unsafe extern "C" {
    pub fn TIFFFileName(arg1: *mut TIFF) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn TIFFSetFileName(
        arg1: *mut TIFF,
        arg2: *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn TIFFError(arg1: *const ::std::os::raw::c_char, arg2: *const ::std::os::raw::c_char, ...);
}
unsafe extern "C" {
    pub fn TIFFErrorExt(
        arg1: thandle_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *const ::std::os::raw::c_char,
        ...
    );
}
unsafe extern "C" {
    pub fn TIFFWarning(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        ...
    );
}
unsafe extern "C" {
    pub fn TIFFWarningExt(
        arg1: thandle_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: *const ::std::os::raw::c_char,
        ...
    );
}
unsafe extern "C" {
    pub fn TIFFSetErrorHandler(arg1: TIFFErrorHandler) -> TIFFErrorHandler;
}
unsafe extern "C" {
    pub fn TIFFSetErrorHandlerExt(arg1: TIFFErrorHandlerExt) -> TIFFErrorHandlerExt;
}
unsafe extern "C" {
    pub fn TIFFSetWarningHandler(arg1: TIFFErrorHandler) -> TIFFErrorHandler;
}
unsafe extern "C" {
    pub fn TIFFSetWarningHandlerExt(arg1: TIFFErrorHandlerExt) -> TIFFErrorHandlerExt;
}
unsafe extern "C" {
    pub fn TIFFWarningExtR(
        arg1: *mut TIFF,
        arg2: *const ::std::os::raw::c_char,
        arg3: *const ::std::os::raw::c_char,
        ...
    );
}
unsafe extern "C" {
    pub fn TIFFErrorExtR(
        arg1: *mut TIFF,
        arg2: *const ::std::os::raw::c_char,
        arg3: *const ::std::os::raw::c_char,
        ...
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TIFFOpenOptions {
    _unused: [u8; 0],
}
unsafe extern "C" {
    pub fn TIFFOpenOptionsAlloc() -> *mut TIFFOpenOptions;
}
unsafe extern "C" {
    pub fn TIFFOpenOptionsFree(arg1: *mut TIFFOpenOptions);
}
unsafe extern "C" {
    pub fn TIFFOpenOptionsSetMaxSingleMemAlloc(
        opts: *mut TIFFOpenOptions,
        max_single_mem_alloc: tmsize_t,
    );
}
unsafe extern "C" {
    pub fn TIFFOpenOptionsSetMaxCumulatedMemAlloc(
        opts: *mut TIFFOpenOptions,
        max_cumulated_mem_alloc: tmsize_t,
    );
}
unsafe extern "C" {
    pub fn TIFFOpenOptionsSetWarnAboutUnknownTags(
        opts: *mut TIFFOpenOptions,
        warn_about_unknown_tags: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    pub fn TIFFOpenOptionsSetErrorHandlerExtR(
        opts: *mut TIFFOpenOptions,
        handler: TIFFErrorHandlerExtR,
        errorhandler_user_data: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn TIFFOpenOptionsSetWarningHandlerExtR(
        opts: *mut TIFFOpenOptions,
        handler: TIFFErrorHandlerExtR,
        warnhandler_user_data: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn TIFFOpen(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut TIFF;
}
unsafe extern "C" {
    pub fn TIFFOpenExt(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        opts: *mut TIFFOpenOptions,
    ) -> *mut TIFF;
}
unsafe extern "C" {
    pub fn TIFFFdOpen(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: *const ::std::os::raw::c_char,
    ) -> *mut TIFF;
}
unsafe extern "C" {
    pub fn TIFFFdOpenExt(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: *const ::std::os::raw::c_char,
        opts: *mut TIFFOpenOptions,
    ) -> *mut TIFF;
}
unsafe extern "C" {
    pub fn TIFFClientOpen(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: thandle_t,
        arg4: TIFFReadWriteProc,
        arg5: TIFFReadWriteProc,
        arg6: TIFFSeekProc,
        arg7: TIFFCloseProc,
        arg8: TIFFSizeProc,
        arg9: TIFFMapFileProc,
        arg10: TIFFUnmapFileProc,
    ) -> *mut TIFF;
}
unsafe extern "C" {
    pub fn TIFFClientOpenExt(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: thandle_t,
        arg4: TIFFReadWriteProc,
        arg5: TIFFReadWriteProc,
        arg6: TIFFSeekProc,
        arg7: TIFFCloseProc,
        arg8: TIFFSizeProc,
        arg9: TIFFMapFileProc,
        arg10: TIFFUnmapFileProc,
        opts: *mut TIFFOpenOptions,
    ) -> *mut TIFF;
}
unsafe extern "C" {
    pub fn TIFFSetTagExtender(arg1: TIFFExtendProc) -> TIFFExtendProc;
}
unsafe extern "C" {
    pub fn TIFFComputeTile(tif: *mut TIFF, x: u32, y: u32, z: u32, s: u16) -> u32;
}
unsafe extern "C" {
    pub fn TIFFCheckTile(tif: *mut TIFF, x: u32, y: u32, z: u32, s: u16) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFNumberOfTiles(arg1: *mut TIFF) -> u32;
}
unsafe extern "C" {
    pub fn TIFFReadTile(
        tif: *mut TIFF,
        buf: *mut ::std::os::raw::c_void,
        x: u32,
        y: u32,
        z: u32,
        s: u16,
    ) -> tmsize_t;
}
unsafe extern "C" {
    pub fn TIFFWriteTile(
        tif: *mut TIFF,
        buf: *mut ::std::os::raw::c_void,
        x: u32,
        y: u32,
        z: u32,
        s: u16,
    ) -> tmsize_t;
}
unsafe extern "C" {
    pub fn TIFFComputeStrip(arg1: *mut TIFF, arg2: u32, arg3: u16) -> u32;
}
unsafe extern "C" {
    pub fn TIFFNumberOfStrips(arg1: *mut TIFF) -> u32;
}
unsafe extern "C" {
    pub fn TIFFReadEncodedStrip(
        tif: *mut TIFF,
        strip: u32,
        buf: *mut ::std::os::raw::c_void,
        size: tmsize_t,
    ) -> tmsize_t;
}
unsafe extern "C" {
    pub fn TIFFReadRawStrip(
        tif: *mut TIFF,
        strip: u32,
        buf: *mut ::std::os::raw::c_void,
        size: tmsize_t,
    ) -> tmsize_t;
}
unsafe extern "C" {
    pub fn TIFFReadEncodedTile(
        tif: *mut TIFF,
        tile: u32,
        buf: *mut ::std::os::raw::c_void,
        size: tmsize_t,
    ) -> tmsize_t;
}
unsafe extern "C" {
    pub fn TIFFReadRawTile(
        tif: *mut TIFF,
        tile: u32,
        buf: *mut ::std::os::raw::c_void,
        size: tmsize_t,
    ) -> tmsize_t;
}
unsafe extern "C" {
    pub fn TIFFReadFromUserBuffer(
        tif: *mut TIFF,
        strile: u32,
        inbuf: *mut ::std::os::raw::c_void,
        insize: tmsize_t,
        outbuf: *mut ::std::os::raw::c_void,
        outsize: tmsize_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFWriteEncodedStrip(
        tif: *mut TIFF,
        strip: u32,
        data: *mut ::std::os::raw::c_void,
        cc: tmsize_t,
    ) -> tmsize_t;
}
unsafe extern "C" {
    pub fn TIFFWriteRawStrip(
        tif: *mut TIFF,
        strip: u32,
        data: *mut ::std::os::raw::c_void,
        cc: tmsize_t,
    ) -> tmsize_t;
}
unsafe extern "C" {
    pub fn TIFFWriteEncodedTile(
        tif: *mut TIFF,
        tile: u32,
        data: *mut ::std::os::raw::c_void,
        cc: tmsize_t,
    ) -> tmsize_t;
}
unsafe extern "C" {
    pub fn TIFFWriteRawTile(
        tif: *mut TIFF,
        tile: u32,
        data: *mut ::std::os::raw::c_void,
        cc: tmsize_t,
    ) -> tmsize_t;
}
unsafe extern "C" {
    pub fn TIFFDataWidth(arg1: TIFFDataType) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFSetWriteOffset(tif: *mut TIFF, off: toff_t);
}
unsafe extern "C" {
    pub fn TIFFSwabShort(arg1: *mut u16);
}
unsafe extern "C" {
    pub fn TIFFSwabLong(arg1: *mut u32);
}
unsafe extern "C" {
    pub fn TIFFSwabLong8(arg1: *mut u64);
}
unsafe extern "C" {
    pub fn TIFFSwabFloat(arg1: *mut f32);
}
unsafe extern "C" {
    pub fn TIFFSwabDouble(arg1: *mut f64);
}
unsafe extern "C" {
    pub fn TIFFSwabArrayOfShort(wp: *mut u16, n: tmsize_t);
}
unsafe extern "C" {
    pub fn TIFFSwabArrayOfTriples(tp: *mut u8, n: tmsize_t);
}
unsafe extern "C" {
    pub fn TIFFSwabArrayOfLong(lp: *mut u32, n: tmsize_t);
}
unsafe extern "C" {
    pub fn TIFFSwabArrayOfLong8(lp: *mut u64, n: tmsize_t);
}
unsafe extern "C" {
    pub fn TIFFSwabArrayOfFloat(fp: *mut f32, n: tmsize_t);
}
unsafe extern "C" {
    pub fn TIFFSwabArrayOfDouble(dp: *mut f64, n: tmsize_t);
}
unsafe extern "C" {
    pub fn TIFFReverseBits(cp: *mut u8, n: tmsize_t);
}
unsafe extern "C" {
    pub fn TIFFGetBitRevTable(arg1: ::std::os::raw::c_int) -> *const ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub fn TIFFGetStrileOffset(tif: *mut TIFF, strile: u32) -> u64;
}
unsafe extern "C" {
    pub fn TIFFGetStrileByteCount(tif: *mut TIFF, strile: u32) -> u64;
}
unsafe extern "C" {
    pub fn TIFFGetStrileOffsetWithErr(
        tif: *mut TIFF,
        strile: u32,
        pbErr: *mut ::std::os::raw::c_int,
    ) -> u64;
}
unsafe extern "C" {
    pub fn TIFFGetStrileByteCountWithErr(
        tif: *mut TIFF,
        strile: u32,
        pbErr: *mut ::std::os::raw::c_int,
    ) -> u64;
}
unsafe extern "C" {
    pub fn LogL16toY(arg1: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn LogL10toY(arg1: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn XYZtoRGB24(arg1: *mut f32, arg2: *mut u8);
}
unsafe extern "C" {
    pub fn uv_decode(
        arg1: *mut f64,
        arg2: *mut f64,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn LogLuv24toXYZ(arg1: u32, arg2: *mut f32);
}
unsafe extern "C" {
    pub fn LogLuv32toXYZ(arg1: u32, arg2: *mut f32);
}
unsafe extern "C" {
    pub fn LogL16fromY(arg1: f64, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn LogL10fromY(arg1: f64, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn uv_encode(arg1: f64, arg2: f64, arg3: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn LogLuv24fromXYZ(arg1: *mut f32, arg2: ::std::os::raw::c_int) -> u32;
}
unsafe extern "C" {
    pub fn LogLuv32fromXYZ(arg1: *mut f32, arg2: ::std::os::raw::c_int) -> u32;
}
unsafe extern "C" {
    pub fn TIFFCIELabToRGBInit(
        arg1: *mut TIFFCIELabToRGB,
        arg2: *const TIFFDisplay,
        arg3: *mut f32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFCIELabToXYZ(
        arg1: *mut TIFFCIELabToRGB,
        arg2: u32,
        arg3: i32,
        arg4: i32,
        arg5: *mut f32,
        arg6: *mut f32,
        arg7: *mut f32,
    );
}
unsafe extern "C" {
    pub fn TIFFXYZToRGB(
        arg1: *mut TIFFCIELabToRGB,
        arg2: f32,
        arg3: f32,
        arg4: f32,
        arg5: *mut u32,
        arg6: *mut u32,
        arg7: *mut u32,
    );
}
unsafe extern "C" {
    pub fn TIFFYCbCrToRGBInit(
        arg1: *mut TIFFYCbCrToRGB,
        arg2: *mut f32,
        arg3: *mut f32,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn TIFFYCbCrtoRGB(
        arg1: *mut TIFFYCbCrToRGB,
        arg2: u32,
        arg3: i32,
        arg4: i32,
        arg5: *mut u32,
        arg6: *mut u32,
        arg7: *mut u32,
    );
}
#[doc = "               O B S O L E T E D    I N T E R F A C E S\n\n Don't use this stuff in your applications, it may be removed in the\nfuture libtiff versions."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TIFFFieldInfo {
    pub field_tag: u32,
    pub field_readcount: ::std::os::raw::c_short,
    pub field_writecount: ::std::os::raw::c_short,
    pub field_type: TIFFDataType,
    pub field_bit: ::std::os::raw::c_ushort,
    pub field_oktochange: ::std::os::raw::c_uchar,
    pub field_passcount: ::std::os::raw::c_uchar,
    pub field_name: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TIFFFieldInfo"][::std::mem::size_of::<TIFFFieldInfo>() - 24usize];
    ["Alignment of TIFFFieldInfo"][::std::mem::align_of::<TIFFFieldInfo>() - 8usize];
    ["Offset of field: TIFFFieldInfo::field_tag"]
        [::std::mem::offset_of!(TIFFFieldInfo, field_tag) - 0usize];
    ["Offset of field: TIFFFieldInfo::field_readcount"]
        [::std::mem::offset_of!(TIFFFieldInfo, field_readcount) - 4usize];
    ["Offset of field: TIFFFieldInfo::field_writecount"]
        [::std::mem::offset_of!(TIFFFieldInfo, field_writecount) - 6usize];
    ["Offset of field: TIFFFieldInfo::field_type"]
        [::std::mem::offset_of!(TIFFFieldInfo, field_type) - 8usize];
    ["Offset of field: TIFFFieldInfo::field_bit"]
        [::std::mem::offset_of!(TIFFFieldInfo, field_bit) - 12usize];
    ["Offset of field: TIFFFieldInfo::field_oktochange"]
        [::std::mem::offset_of!(TIFFFieldInfo, field_oktochange) - 14usize];
    ["Offset of field: TIFFFieldInfo::field_passcount"]
        [::std::mem::offset_of!(TIFFFieldInfo, field_passcount) - 15usize];
    ["Offset of field: TIFFFieldInfo::field_name"]
        [::std::mem::offset_of!(TIFFFieldInfo, field_name) - 16usize];
};
unsafe extern "C" {
    pub fn TIFFMergeFieldInfo(
        arg1: *mut TIFF,
        arg2: *const TIFFFieldInfo,
        arg3: u32,
    ) -> ::std::os::raw::c_int;
}
pub type __builtin_va_list = *mut ::std::os::raw::c_char;
